{

  "FunctionsDefinitions": {

    "CompressionPerpendicularToTheGrain": {
      "BeamCompression": "This function calculates the compression perpendicular to the grain in a beam, for construction to Eurocode 5 and CTE SE-M standards.",
      "EndSleeperBeam": "This function calculates the compression perpendicular to the grain generated by a beam on the end of a sleeper, for construction to Eurocode 5 and CTE SE-M standards.",
      "EndSleeperPillar": "This function calculates the compression perpendicular to the grain generated by a pillar on the end of a sleeper, for construction to Eurocode 5 and CTE SE-M standards.",
      "MiddleSleeperPillar": "This function calculates the compression perpendicular to the grain exerted by a pillar on the middle of a sleeper, for construction to Eurocode 5 and CTE SE-M standards.",
      "MiddleSleeperBeam": "This function calculates the compression perpendicular to the grain exerted by a beam on the middle of a sleeper, for construction to Eurocode 5 and CTE SE-M standards.",
      "EndDiscreteSupport":"This function calculates the compression perpendicular to the grain in the end of beam with discrete supports, for construction to Eurocode 5 and CTE SE-M standards.",
      "AllCases":"This case allow calculate compression perpendicular to the grain following Eurocode 5 in all situation. Other functions may be more intuitive and friendly. Please do not hesitate to contact us with any queries."
    },
    "CompressiveStressesAtAnAngleToTheGrain": {
      "AngleRafter": "This function calculates the compression stresses at an angle to the grain exerted on the support of a rafter seat, for construction to Eurocode 5 and CTE SE-M standards.",
      "AllCases":"This case allow calculate compression at an angle to the grain following Eurocode 5 in all situation. Other functions may be more intuitive and friendly. Please do not hesitate to contact us with any queries."
    },
    "NotchedMembers": {
      "NotchOnSupport": "For beams notched on the same side as the support. This function calculates the shear stresses at the notched support generated on a beam, for construction to Eurocode 5 and CTE SE-M standards.",
      "NotchOppositeTheSupport": "For beams notched at the same side to the support. This function calculates the shear stresses at the notched support generated on a beam, for construction to Eurocode 5 and CTE SE-M standards.",
      "AllCases":"This function can be used to calculate any instance of beams with rectangular cross-sections and a notch at the  support, for construction to Eurocode 5 standards. Dedicated  functions may be more intuitive and user-friendly. If you are unsure, contact us!"
    },

    "MortiseTenon": {
      "MortiseTenonPillar": "This function calculates the compression perpendicular to the grain, in a mortise tenon joint,  generated by a pillar on a sleeper, for construction to Eurocode 5 and CTE SE-M standards.",
      "MortiseTenonShear": "This function calculates the shear stresses, in a mortise tenon joint,  generated on a beam, for construction to Eurocode 5 and CTE SE-M standards."
    }
  }
}
